
{
    "home":"Home",
    "about":"About",
    "products":"Products & Services",
    "contact":"Contact",
    "contdesc":"We will help you unwind your bussiness",
    "add":"Our Address",
    "phone":"Phone Numbers",
    "email":"Email Address",
    "bsshr":"Bussiness hour",
    "talk":"Let's Talk",
    "touch":"Touch",
    "services":"Services",
    "servicep":"Service Provided",
    
    "location":"Dammam 31461 Kingdom of Saudi Arabia",
    "loctech":"Jubail Dhahran highway | Opposite to Dammam Television Complex Post Box 1848 | Dammam 31441 | KSA ",
    "locapeco":"Main Office | Al Bassam Tower |10th Floor P.O. Box 2611, 1st Street, Dammam 31461, Saudi Arabia  ",

    "welcomeabc":"WE ARE AL BASSAM GROUP OF COMPANIES",
    "welcometext":"Welcome to Al Bassam Group",
    "herotext":"Welcome To <br />Al Bassam Group <br />Of Companies",
    "letsgetstart":"Let's get started",
    "watchv":"Watch the video",
    "aboutdesc":" Albassam Group is a renowned group of companies with industrial & commercial interests. Its history began trading in petroleum equipment to Saudi Aramco in 1955. Later,the group expanded its operations across diversified sectorsincluding Trading, Petroleum Services, NDT & Lab. Services,Manufacturing, Contracting, Travel & Tourism, Water Treatment and Real Estate with aim to establish industries and services,generate value for our shareholders, develop alliances, transfer technologies and create employment opportunities.",
    "aboutmission":" MISSION: To establish industries and services ,create value forour shareholders, develop strategic alliances ,transfer technology and create employment opportunities while holding paramount our commitment to quality ,safety ,social responsibility and environmental preservation.",
    "learnmore":"Learn More",
    "freecall":"Feel Free To Call Us",
    "experincetrust":"Experience Trust",
    "exploreservices":"Explore Our Services",


    "mission":"Our Mission",
    "missiondesc":" We are committed to serve and support the industrial sectors by  providing the widest range possible of quality industrial inspection and NDT services. We rely on a group of self-motivated and professional staff to perform these services staff whom we believe to be our most valuable asset and to whose  continual improvement we are wholly committed.",
    "vision":"Our Vision",
    "visiondesc":"Our vision is to be recognized as the best provider of intelligent inspection solutions. We will achieve this by relying on the safest, most accurate, and most time and cost  effective hi-tech techniques. Our motto is “working together with our clients to achieve excellence in industrial reliability”. Form more information visit www.issksa.com.",


    "trading":"Trading",
    "tradingdesc":" <li>Tubing & Casing — API / PREMIUM CONNECTIONS</li><li>Line Pipe – Seamless</li><li>Drill Pipe</li>",
    "manufac":"Manufacturing",
    "manufacdesc":"<li>Repair and Refurbishment Services of Storage Tanks</li><li>Re-Tubing & Maintenance Services</li><li>Maintanance / Repair Work for Shutdowns.</li>",
    "its":"Inspection & Testing Services",
    "itsdesc":" <li>Radiographic Testing</li> <li>Utlrasonic Testing</li> <li>Penetrant Testing</li>",
    "wt":"Water Treatment",
    "wtdesc":" <li>Reverse Osmosis Systems and Membranes Processes</li>  <li>Ion Exchange Systems</li> <li>Clarification Equipment</li>",
    "auto":"Automobiles",
    "autodesc":"<li>A well maintained fleet of more than 60 Trailers covering a wide range of all Saudi roads & trucks.</li><li>Efficient to provide the utmost level of satisfaction to the customers by facilitating them our prompt,quick & fast and well-versed services are for all locations.</li>",
    "realestate":"Real Estate",
    "realestatedesc":"<li>50 Story mixed used tower on Shaikh Zayed Highway in Dubai</li><li>40 Story residential tower in Sharjah</li><li>7 Story residential complex in Dubai</li>",
    "travels":"Travel & Tourism",
    "technohead":"Techno Serve – Al-Bassam Petroleum Equipment Company",
    "sofhead":"Saudi Oil Field",
    "sofabc":"Saudi Oil Field – Al-Bassam Petroleum Equipment Company",
    "ghiabchead":" Gulf Heavy Industries Co. – Al-Bassam Petroleum Equipment Company",

    "ghiabcdesc":"GULF HEAVY INDUSTRIES CO. (GHI) Gulf heavy Industries Co. (GHI)  is part of Al-Bassam Group of Companies, which is one of the first private conglomerates in the Kingdom of Saudi Arabia. GHI  formerly known as Gulf Engineering Company was established in  1984 as one of the largest specialized heavy steel fabrication company in the Middle East region with two (02) manufacturing locations in Jubail Industrial City of Saudi Arabia First one is situated near HADEED with total area of 30,000 M2 and Second one in Royal Commission Area with total space of 38,000 M2",
    "issabchead":" Industrial Support Service – Al-Bassam Petroleum Equipment Company",

    "ftdesc":" Albassam Group is a renowned group of companies with industrial commercial interests. Its history began with trading in petroleum equipment to Saudi Aramco in 1955.",
    "ftctry":"Saudi Arabia",


    "albcomp":"Following Are The Companies Of Al Bassam Group",
    
    "apecottl":"APECO – Al-Bassam Petroleum Equipment Company",
    "apecodesc":"Al-Bassam Petroleum Equipment Company (APECO) is a wholly owned subsidiary of Al-Bassam Group with its headquarters in Dammam. Est",
    "techttle":"TECHNOSERVE SAUDI ARABIA CO. LTD",
    "techdesc":"TechnoServe Saudi Arabia Co. LTD is a dynamic leading industrial conglomerate in Saudi Arabia, established in the year 2002",
    "ghittle":"GULF HEAVY INDUSTRIES CO. (GHI)",
    "ghidesc":"Gulf heavy Industries Co. (GHI) is part of Al-Bassam  Group of Companies, which is one of the first private   conglomerates in the Ki",
    "issttle":"Industrial Support Service",
    "issdesc":"ISS is a distinguished & leading inspection services company in the Kingdom and targeted in providing wide range of Inspection",
    "iatttle":"Al-Bassam International Automobile Agency",
    "iatdesc":"Gulf Miles Company is a subsidiary of Al-Bassam Group ofCompanies. It is one the well-known & reputed logistic company in the...",
    "swtttle":"Saudi Water Technology",
    "swtdesc":"Saudi Water Technology (SWT) is a member of Al Bassam group of companies and one of the pioneers in the water and waste water trea",
    "trttle":"Al-Bassam Travel & Tourism",
    "trdesc":"  Al Bassam Travel & Tourism started its operations way  back in the year 1969, as an IATA accredited member.Today it is ranked",


    "realdesc":"Al-Bassam Real Estate is engaged in investments particularly in Real Estate projects within and outside of Saudi Arabia.",
    "byttle":"Al Bassam Yachts",
    "bydesc":" Al Bassam Passenger Yachts & Boat rental L.L.C rental was established in 2009 in Dubai ,one of the leading yacht charter company",
    "rhpttle":"Al Raya Hotel Apartments",
    "rhpdesc":"Al Raya Hotel Apartment is a standard Apartment style & centrally located in the heart of Bur Dubai.It is only 10 minutes from Dubai International Airport",


    "techabcdesc":" TechnoServe Saudi Arabia Co. LTD is a dynamic leading industrial   conglomerate in Saudi Arabia, established in the year 2002 in  the name of Eurotechnology Saudi Co Ltd. The Company is jointly owned by Al Bassam Group, Al-Haitam for Industries & Economic Development and Dynamic Energy Company. Technoserve’s oilfield centre is situated in Dammam, Kingdom of Saudi Arabia on the main Dhahran – Jubail Highway. Our facility is situated in a 35,000 m2 location which offers a full range of services for our customers including Inspection, Repair, Manufacture and Re-Certification. The company’s machine shop facility is licensed by American Petroleum institute (API) to manufacture drilling equipment, API blind, swivel, weld neck, and threaded companion flanges, flanged and hub connection pressure control equipment, clamps, flanged and studded crosses, tees, spools, double studded adapters, and more. We currently hold the API 5CT, API 6A, API 16A and API 7-1 Licences from API as well as being an approved facility with API Q1, ISO 9001:2008 and ISO/TS 29001 Accreditation. We provide all of the above to Saudi Aramco  and to all the major Drilling Companies within the Kingdom of Saudi Arabia and GCC. We hold additional licences from Grant Prideco to cut their XT series connections and from Voest Alpine to cut 2-3/8 to 7” VAGT premium connections . We are doing all repair and re-certification of valves and choke manifolds, as well.",
    "sofdesc":"Our purpose follow leading design, engineering and industrial manufacturing company specialising in mining, oil, gas and engineering services. Our purpose follow leading design, engineering and industrial.",
    "apecodesc2":"  APECO – Al-Bassam Petroleum Equipment Company Al-Bassam  Petroleum Equipment Company (APECO) is a wholly owned subsidiary  of Al-Bassam Group with its headquarters in Dammam. Established in the year 1955, Al-Bassam is one the leading companies in Saudi Arabia and in the other Gulf States having a diversified range of activities including Trading, Engineering & Contracting and is a registered supplier of reliable vital products.  Al-Bassam Petroleum Equipment Company (APECO) ranks as the earliest among Al-Bassam Group of companies. Ever since it was established, it has been remarkably noticed as the basic unit for the activities that constitute the aggregate dealings of Al-Bassam Group for almost 50 years of successful achievements. The activities of APECO are mainly confined to the Supply & Installation of equipment to Oil & Gas Industry. A brief review of history of the company reveals that besides the drilling & production equipment, the company also provides equipment in the field of Production, Refining & Transportation.",
    "issabcdesc":"ISS is a distinguished & leading inspection services company in the Kingdom and targeted in providing wide range of Inspection services as well as laboratory services with high quality at reasonable prices and in a timely manner. We are committed to improve the quality of our services by continual up-gradation.ISS has been providing testing services since 1983. Our client list includes Saudi Aramco, Saudi Chevron, SECO, SABIC, SASREF,and Luberef to name a few..",
    "swtabchead":" Saudi Water Technology(SWT) – Al-Bassam Petroleum Equipment Company",
    "swtabcdesc":"Saudi Water Technology (SWT) is a member of Al Bassam group of companies and one of the pioneers in the water and waste water treatment applications in the area. We are a leading supplier and whole sale distributor of wide spectrum of water treatments systems, components and spare parts. Our activities ranges from small bracket mounted water treatment systems to large scale and industrial custom built plants. SWT has tackled the tough nature of water treatment projects by using up to date technologies. Our unexcelled services and products quality have been the Key to success and growth",
   
    "objective":"Objective",
    "objectivedesc":"SWT’s Main objective is to provide complete and efficient water and wastewater treatment systems combined with superior engineering capabilities to assure the quality of our products and services. Saudi water technology utilizes speed and accuracy to the world of water treatment activities and provides cost effective solutions that satisfies our customer’s needs.",
    "swtteam":"SWT’S TEAM",
    "swtdesc2":"The Key to our success is a young highly qualified and multi disciplinary team. SWT highly trained and well-experienced engineers and technicians abreast of current developments  provide a unique standard to SWT’s capabilities to confront problems in the water treatment applications. Thus, our team and the flexibility of range of equipment offer a state-of-the-art  design and superior quality that establishes competitiveness in the world of water treatment.  ",

    "clients":"Our Clients",
    "cl1":"SEC established as a Saudi joint stock company with a paid-up capital of SR 33,758,632,650",
    "cl2":"Saudi Aramco ,a fully integrated, global petroleum and chemicals enterprise, is the state-owned oil company",
    "cl3":"Sasref,In 1981 Pertomin and Shell signed a joint agreement to establish a refinery complex. Construction of the ref",
    "cl4":"Mahindra,We began manufacturing tractors in the early 1960s for the Indian market. Nearly 50 years later,",
    "cl5":"Petro Rabic utilizes 400,000 barrels per day of crude oil and 1.2 million tons per year of ethane as primary",
    "cl6":"Sabic is the Saudi Basic Industries Corporation,headquartered in Riyadh, Saudi Arabia.",
    "cl7":"Sadara Chemical Company represents a unique alliance between two corporate leaders in their respective",
    "cl8":"Saipem is a large, international and one of the best balanced turnkey contractors in the oil & gas industry",








    "trs1":"Tubing & Casing — API / PREMIUM CONNECTIONS",
    "trs2":"Line Pipe – Seamless",
    "trs3":"Drill Pipe",
    "trs4":" Valves – Gate, Globe, Check, Ball, Butterfly",
    "trs5":" Downhole Gauges – Pressure & Temperature",
    "trs6":"Industrial Batteries",
    "trs7":"Flanges / Fittings",
    "trs8":"Industrial Cycles",
    "trs9":"Additive Injectors",
    "trs10":"RO Plants & Spares",
    "trs11":"Diesel Engines / Generator Sets / Pumps",
    "trs12":"Compressors",

    
    "s1":" Site Fabrication, Installation and Supervision equipped with required machineries by skilled personnel for all kinds of Pressure Vessels, Columns, Reactors, storage tanks etc.",
    "s2":"  Re-Tubing & Maintenance Services for All types of Heat Exchangers & Boilers.",
    "s3":"Repair and Refurbishment Services of Storage Tanks including Tank bottom replacements etc.",
    "s4":"  Fabrication/ Repair/ Maintenance Work for Shutdowns.",
    "s5":" Plate Rolling, U-Tube Bending, Sections and Pipe Bending, Drilling, Shearing, Bending and Press Brake Work.",
    "s6":"  Heat Treatment – At GHI Works using Furnace of Size: 8 M Wide x 8 M High x 12 M Long. At site using local heat treatment by electrical heating.",
    "s7":" Largest Rolling Machine in the Middle East which can be rolled the plates up to 200 mm thickness.",
    "s8":"Shutdown & Maintenance jobs.",
    
    "is1":"Radiographic Testing",
    "is2":"Utlrasonic Testing",
    "is3":"Penetrant Testing",
    "is4":"Holiday Testing",
    "is5":"Leak Detection",
    "is6":"Inspection Services",
    "is7":"Pipe Line InspectionServices",
    "is8":"Tank Bottom/ Floor inspection",
    "is9":"Piping NDT",
    "is10":"Extensive sampling Process",
    
    "wt1":"Reverse Osmosis Systems and Membranes Processes",
    "wt2":"Ion Exchange Systems",
    "wt3":"Clarification Equipment",
    "wt4":"Ultraviolet and Ozonation",
    "wt5":"Pumps and Dosing Systems",
    "wt6":"Waste Water Treatment Systems",
    "wt7":"Long-Term Maintenance Contracts",
    "wt8":"Frequent Preventive Maintenance Schedules",
    "wt9":"Feasibility Studies",
    "wt10":"  Full Laboratory Control Over Water and Waste water QualityNDT",

    "at1":" A well maintained fleet of more than 60 Trailers  covering a wide range of all Saudi roads & trucks.",
    "at2":" Efficient to provide the utmost level of satisfaction   to the customers by facilitating them our prompt,  quick & fast and well-versed services are for all locations.",
    "at3":"All our drivers are well experienced, friendly nature,  humble, obedient and familiar to utilize latest  transport machinery and workshop tools.",
    "at4":" Gulf Miles has its own skilled professional and expert    personnel in all required fields of tool systems &  repairing workshops.",
    "at5":" We have 24×7 Mobile Services to facilitate our  respected customers for better coordination and  jointly to accomplish the assigned jobs in a timely manner.",

    "rl1":" 50 Story mixed used tower on Shaikh Zayed Highway in Dubai",
    "rl2":"40 Story residential tower in Sharjah",
    "rl3":"15 Story tower which will be Al-Bassam Group Headquarter in Dammam",
    "rl4":" 7 Story residential complex in Dubai",
    "rl5":"Luxurious villas compound in UAE",

    "tr1":" Organizing Tours, both on Domestic and International destinations",
    "tr2":"Individual and all-inclusive group tours",
    "tr3":"Hotel, Villa and Apartment rentals across the world",
    "tr4":"Choice of Cruise destination reservations",
    "tr5":"Car rentals across the world",
    "tr6":"Disney World Passes",

    "tech1":"Cross-over connectors",
    "tech2":"Top connectors",
    "tech3":"Tees and Crosses",
    "tech4":"Adapter and Spacer spools",
    "tech5":"Flanged Connectors",
    "tech6":"Thread Connectors",
    "tech7":"Other End connectors",
    "tech8":"Companion Flanges",
    "tech9":"Weld Neck Flanges",
    "tech10":"Hub connections",
    "tech11":"Drilling Spools",
    "tech12":"Manifold Equipment",
    "tech13":"Double Studded Adaptors",
    
    "sof1":"Wireline tools",
    "sof2":"Coiltubing tools",
    "sof3":"Downhole flow control tools",
    "sof4":"Pressure control equipment's (PCE)",
    "sof5":"Exwell control modules and test units",
    
    "sofs1":"Material science",
    "sofs2":"Chemical research",
    "sofs3":"Best engineer",
    "sofs4":"Power and energy",
    
    "ape1":"Diversified competences",
    "ape2":"Saudi Arabian Oil Company (Saudi Aramco)",
    "ape3":"Saudi Electricity Company (SEC)",
    "ape4":" Saudi Arabian Basic Industries Corporation (SABIC)",
    "ape5":"Government & Semi-Government Organization",
    "ape6":"Slukoil / Sinope",
    "ape7":"Cworley / Petrocon",
    "ape8":"FluorLummus",
    "ape9":"Refineries",
    "ape10":"Petrochemical Companies",

    "apep1":"Tubing & Casing — API / PREMIUM CONNECTIONS",
    "apep2":"Line Pipe – Seamless",
    "apep3":"Drill Pipe",
    "apep4":"Valves – Gate, Globe, Check, Ball, Butterfly",
    "apep5":"Downhole Gauges – Pressure & Temperature",
    "apep6":"Industrial Batteries",
    "apep7":"Flanges / Fittings",
    "apep8":"Industrial Cycles",
    "apep9":"Additive Injectors",
    "apep10":"RO Plants & Spares",
    "apep11":"Diesel Engines / Generator Sets / Pumps",
    "apep12":"Compressors",
    
    "ghireg":"GHI Has Following Registration",
    "reg1":"Licensed by the Ministry of Industry No .312/S",
    "reg2":"Registered with Ministry of Commerce under CR No 2050014532",
    "reg3":"Registered with Chamber of Commerce & Industries under member-ship No.3219/2",

    "s1-1":"TANK BOTTOM/ FLOOR INSPECTION",
    "s1desc-1":" ank Floor Bottoms Scanning using Low Frequency Electromagnetic Testing (LFET) method – Using Falcon 2000 instrument of TesTex Inc.",
    "s1desc-2":" USABEETLE -UT Thickness measuring of tank walls without scaffolding",
    "s1desc-3":"Vacuum box leak detection",

    "s2-1":"RADIOGRAPHIC TESTING",
    "s2desc-1":"Radiography using X-ray / Gamma ray",
    "s2desc-2":"Radiography of weld joint, Profile shots for corrosion monitoring, ASME Code pressure vessels, Piping as per API 1104, ASME B31.3/31.1, Pipelines, Radiography of Tanks etc.",
    "s2desc-3":"Filmless radiography",

    "s3-1":"ULTRASONIC TESTING",
    "s3desc-1":"Thickness Gauging using Thickness gauge, Thickness gauge with ‘A’ Scan",
    "s3desc-2":" High Temp. UT / Thickness Measurement",
    "s3desc-3":"UT Scanning for Corrosion",

    "s4-1":"OTHER RELATED SERVICES",
    "s4desc-1":" Metallurgical services – Using The Welding Institute, U.K.",
    "s4desc-2":"Training & certification on NDT, Welding Inspection & Radiographic Film Interpretation.",
    "s4desc-3":"Software assistance for Mechanical Plant Integrity – Through TWI U.K.",

    "swt-1":"Reverse Osmosis Systems and Membranes Proceses",
    "swt-2":"Sea water, brackish water RO systems",
    "swt-3":"Nanofiltration",
    "swt-4":"Ultrafiltration",
    "swt-5":"Microfiltration",
    "swt-6":"Ion Exchange Systems",
    "swt-7":"Cation and anion ion exchange units",
    "swt-8":"Mixed beds",
    "swt-9":"Sodium cycle softeners",
    "swt-10":"Polisher",
    "swt-11":"Clarification Equipment",
    "swt-12":"Filtration and Pre-treatment Equipment",
    "swt-13":"Pressure filtration",
    "swt-14":"Multi-Media, Activated Carbon, Iron Removal",
    "swt-15":"Ultraviolet and Ozonation",
    "swt-16":"Chlorination and Disinfection",
    "swt-17":"Pumps and Dosing Systems Waste Water Treatment Systems",
    "swt-18":"Specialty and Commodity Water Treatment Chemicals",
    
    "swts1":"Long-Term Maintenance Contracts",
    "swts2":"Frequent Preventive Maintenance Schedules",
    "swts3":"Feasibility Studies",
    "swts4":"Process Design and Engineering",
    "swts5":"Projects Installation and Commissioning",
    "swts6":"Full Laboratory Control Over Water and Waste water Quality"
    
}